import { AnnouncementListResponse, AnnouncementResponse } from 'type/announcement';

export const announcementList: AnnouncementListResponse = {
  announcements: [
    {
      id: 1,
      title: '공지 제목입니다',
      content: '공지 내용입니다',
      author: '아커',
      createdAt: '2023-10-11T17:10:04:3434',
    },
    {
      id: 2,
      title: '공지 제목입니다',
      content: '공지 내용입니다',
      author: '아커',
      createdAt: '2023-10-11T17:10:04:3434',
    },
    {
      id: 3,
      title: '공지 제목입니다',
      content: '공지 내용입니다',
      author: '아커',
      createdAt: '2023-10-11T17:10:04:3434',
    },
    {
      id: 4,
      title: '공지 제목입니다',
      content: '공지 내용입니다',
      author: '아커',
      createdAt: '2023-10-11T17:10:04:3434',
    },
    {
      id: 5,
      title: '공지 제목입니다',
      content: '공지 내용입니다',
      author: '아커',
      createdAt: '2023-10-11T17:10:04:3434',
    },
    {
      id: 6,
      title: '공지 제목입니다',
      content: '공지 내용입니다',
      author: '아커',
      createdAt: '2023-10-11T17:10:04:3434',
    },
    {
      id: 7,
      title: '공지 제목입니다',
      content: '공지 내용입니다',
      author: '아커',
      createdAt: '2023-10-11T17:10:04:3434',
    },
    {
      id: 8,
      title: '공지 제목입니다',
      content: '공지 내용입니다',
      author: '아커',
      createdAt: '2023-10-11T17:10:04:3434',
    },
  ],
  hasNext: true,
  lastCursorId: 1,
};

export const announcement: AnnouncementResponse = {
  title: '공지 제목입니다',
  content:
    '공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.공지 내용입니다.',
  author: '아커',
  createdAt: '2023-10-11T17:10:04:3434',
};
